; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=25, remove_proportion=0.101, bases=10, instance_id=6, output=./training, seed=47

(define (problem warehouse-06)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 - base
    )
    (:init
        (to-remove box3)
        (to-remove box12)
        (clear box19)
        (on box19 box11)
        (on box11 box13)
        (on box13 box15)
        (on-base box15 base1)
        (clear box14)
        (on-base box14 base2)
        (clear-base base3)
        (clear box24)
        (on box24 box23)
        (on-base box23 base4)
        (clear box6)
        (on box6 box16)
        (on-base box16 base5)
        (clear box5)
        (on box5 box20)
        (on-base box20 base6)
        (clear box8)
        (on box8 box1)
        (on box1 box12)
        (on box12 box9)
        (on box9 box22)
        (on-base box22 base7)
        (clear box17)
        (on box17 box3)
        (on-base box3 base8)
        (clear box18)
        (on box18 box7)
        (on box7 box25)
        (on box25 box2)
        (on-base box2 base9)
        (clear box21)
        (on box21 box10)
        (on box10 box4)
        (on-base box4 base10)
    )
    (:goal (and 
        (removed box3)
        (removed box12)
    ))
)

; plan
1. (move box17 box3 box14)
   deleted: (clear box14) (on box17 box3)
   added: (on box17 box14) (clear box3)
   goals met: 0 of 2
2. (move box8 box1 box17)
   deleted: (clear box17) (on box8 box1)
   added: (on box8 box17) (clear box1)
   goals met: 0 of 2
3. (move box1 box12 box18)
   deleted: (clear box18) (on box1 box12)
   added: (on box1 box18) (clear box12)
   goals met: 0 of 2
4. (remove box12 box9)
   deleted: (on box12 box9) (clear box12)
   added: (removed box12) (clear box9)
   goals met: 1 of 2
5. (remove-from-base box3 base8)
   deleted: (on-base box3 base8) (clear box3)
   added: (removed box3) (clear-base base8)
   goals met: 2 of 2
